<?php
/**
 * Created by IntelliJ IDEA.
 * User: visen
 * Date: 2020-01-31
 * Time: 14:15
 */

return [

    /*
    |--------------------------------------------------------------------------
    | customized http code
    |--------------------------------------------------------------------------
    |
    | The first number is error type, the second and third number is
    | product type, and it is a specific error code from fourth to
    | sixth.But the success is different.
    |
    */

    'code' => [

        // 系统模块
        100001 => '签名错误',
        100002 => '缺少参数',
        100003 => '参数校验失败',
        100004 => '操作失败',
        100005 => '图片无效',

        // 认证模块
        200001 => '用户名无效',
        200002 => '密码无效',
        200003 => '用户名已存在',
        200004 => '密码错误',
        200005 => '验证码错误',
        200006 => '注册失败',
        200007 => '登录失败',

        // 用户模块
        300001 => '用户不存在',
        300002 => '用户昵称无效',
        300003 => '用户头像无效',

        // 文章模块
        400001 => '文章标题无效',
        400002 => '文章内容无效',
        400003 => '文章类型无效',
        400004 => '缺少参数pid',
        400005 => '缺少参数uid',
        400006 => '缺少参数cid',
        400007 => '缺少参数mid',
    ],

];
